## C# language module for sharpvim.
{ pkgs }:

{
  lspsAndRuntimeDeps = with pkgs; [
    omnisharp-roslyn
    csharpier
    vimPlugins.omnisharp-extended-lsp-nvim
  ];

  debug = with pkgs; [
    netcoredbg
  ];

  formatters = {
    cs = [ "csharpier" ];
  };

  linters = {};

  treesitter = [ "c_sharp" ];

  packageName = "sharpvim";
  appName     = "sharpvim";
  lspName     = "omnisharp";

  logo = ''
███████╗██╗  ██╗ █████╗ ██████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗
██╔════╝██║  ██║██╔══██╗██╔══██╗██╔══██╗██║   ██║██║████╗ ████║
███████╗███████║███████║██████╔╝██████╔╝██║   ██║██║██╔████╔██║
╚════██║██╔══██║██╔══██║██╔══██╗██╔═══╝ ╚██╗ ██╔╝██║██║╚██╔╝██║
███████║██║  ██║██║  ██║██║  ██║██║      ╚████╔╝ ██║██║ ╚═╝ ██║
╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝       ╚═══╝  ╚═╝╚═╝     ╚═╝
  '';

  ls-path = "${pkgs.omnisharp-roslyn.outPath}/bin/OmniSharp";
}
