## Zig language module for zvim.
{ pkgs }:

{
  lspsAndRuntimeDeps = with pkgs; [
    zls
    zig
  ];

  debug = with pkgs; [
    lldb
  ];

  formatters = {
    zig = [ "zigfmt" ];
  };

  linters = {};

  treesitter = [ "zig" ];

  packageName = "zvim";
  appName     = "zvim";
  lspName     = "zls";

  logo = ''
███████╗██╗   ██╗██╗███╗   ███╗
╚══███╔╝██║   ██║██║████╗ ████║
  ███╔╝ ██║   ██║██║██╔████╔██║
 ███╔╝  ╚██╗ ██╔╝██║██║╚██╔╝██║
███████╗ ╚████╔╝ ██║██║ ╚═╝ ██║
╚══════╝  ╚═══╝  ╚═╝╚═╝     ╚═╝
  '';

  ls-path = "${pkgs.zls.outPath}/bin/zls";
}
